## Infro diff for 2215975

<img src="https://argo-cd.readthedocs.io/en/stable/assets/favicon.png" width="20"/> **my-argo-managed-cluster > example-helm** *(1 files changed)*
<details open>

~~~diff
===== /ConfigMap default/my-config-map ======
3c3
<   my_heart_is: black
---
>   my_heart_is: healthy
~~~


<img src="https://registry.terraform.io/images/favicons/favicon-32x32.png" width="20"/> **terraform > my-tf-managed-infra** *(1 files changed)*
<details open>

~~~diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_config_map.my_config_map will be created
+   resource "kubernetes_config_map" "my_config_map" {
+       data = {
+           "what_is_this" = "data"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "my-config-map"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
~~~


<!-- INFRO -->